alert(`Привіт! Пропоную тобі зіграти в гру, яка називається "Вгадай число". Правила гри прості: 
      Програма генерує випадкове число в заданому діапазоні (1-10), і ти маєш його вгадати.`);
//Правила гри
if (confirm(`Чи бажаєш ти зіграти?`)) {//запит до користувача 
  alert(`Чудово, погнали!`);//ОК - видаємо модальне вікно запрошення
} else {
  alert(`Можливо, в інший раз. До побачення!`);//Скасовує - видаємо модальне прощання
let number = (randomNumber = Math.floor(Math.random() * 10) + 1);//Створюємо змінну для визначення рандомного числа
let value = +prompt(`Ітак твоє число ?`);//Створюємо змінну для визначення значення, що ввів користувач, + валідація вводу (запевняємося, що введено саме число)
if (value === number) {//якщо значення змінної користувача дорівнює значенню змінної рандомного числа видаємо модальне вікно з вітанням
  alert(`Ти переміг, вітаю! Це дійсно було число ${number}`);//в модальне вікно виводимо значення змінної радномного числа для підтвердження
} else {//якщо значення змінної користувача не дорівнює значенню змінної рандомного числа видаємо модальне вікно з правильним числом  
  alert(
    `Сьогодні інтуїція не на твоїй стороні, сорян. Загадане число:${number}`
  );
}
